app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 14]]
---
        <td>
    <%= "コメント数 #{@book.book_comments.count}"%>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 17]]
---
<ol>
    <% @book.book_comments.each do |book_comment| %>