app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "updated_at", "body", "title", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-06-20 14:51:55.859286"], ["updated_at", "2020-06-20 14:51:55.859286"], ["body", "a"], ["title", "a"], ["user_id", 1]]
SELECT "books".* FROM "books"
---
    def create
        @book = Book.new(book_params)
    	@book.user_id = current_user.id
    	 if @book.save

            redirect_to @book, notice: "successfully create book!"
         else
        @books = Book.all

SELECT "books".* FROM "books"
---
    def index
    	@book = Book.new

        @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @book = Book.find(params[:id])
       @book_comment = BookComment.new

    	 @book = Book.find(params[:id])