app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "fff"], ["user_id", 1], ["book_id", 15], ["created_at", "2020-06-20 17:00:31.207501"], ["updated_at", "2020-06-20 17:00:31.207501"]]
---
	def create
    book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 3]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 3], ["book_id", 14], ["LIMIT", 1]]
---
    def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy