app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 13], ["created_at", "2020-06-20 17:53:10.392190"], ["updated_at", "2020-06-20 17:53:10.392190"]]
---
	def create
            book = Book.find(params[:book_id])
            favorite = current_user.favorites.new(book_id: book.id)
            favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 19], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 30]]
---
        def destroy
            book = Book.find(params[:book_id])
            favorite = current_user.favorites.find_by(book_id: book.id)
            favorite.destroy